Revit 2024 API
UIControlledApplication.TransferringProjectStandards Event
 Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017.2
Syntax
C#
public event EventHandler<TransferringProjectStandardsEventArgs> TransferringProjectStandards
Visual Basic
Public Event TransferringProjectStandards As EventHandler(Of TransferringProjectStandardsEventArgs)
Visual C++
public:
 event EventHandler<TransferringProjectStandardsEventArgs^>^ TransferringProjectStandards {
	void add (EventHandler<TransferringProjectStandardsEventArgs^>^ value);
	void remove (EventHandler<TransferringProjectStandardsEventArgs^>^ value);
}
Remarks
This event allows an external application to add additional items to the possible list of items to be transferred. These items will be visible and selectable in the Transfer Project Standards dialog box. By default, new items added in this manner will be enabled for transfer. During the scope of this event, modification is not permitted to either the source or target documents. And this event is not cancellable.
See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace